In [7]:
import pandas as pd

product_id = [101, 102, 103, 104, 105]
product_name = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
product_price = [10.99, 20.49, 15.99, 25.99, 30.49]


df = pd.DataFrame({
    'ProductID': product_id,
    'ProductName': product_name,
    'ProductPrice': product_price})

print(df)

   ProductID ProductName  ProductPrice
0        101   Product A         10.99
1        102   Product B         20.49
2        103   Product C         15.99
3        104   Product D         25.99
4        105   Product E         30.49

In [4]:
import pandas as pd


product_id = [101, 102, 103, 104, 105]
product_name = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
product_price = [10.99, 20.49, 15.99, 25.99, 30.49]

df = pd.DataFrame({
    'ProductID': product_id,
    'ProductName': product_name,
    'ProductPrice': product_price
})


product_ids = df['ProductID']
product_names = df['ProductName']
product_prices = df['ProductPrice']

print("Product IDs:")
print(product_ids)
print("Product Names:")
print(product_names)
print("Product Prices:")
print(product_prices)

Product IDs:
0    101
1    102
2    103
3    104
4    105
Name: ProductID, dtype: int64
Product Names:
0    Product A
1    Product B
2    Product C
3    Product D
4    Product E
Name: ProductName, dtype: object
Product Prices:
0    10.99
1    20.49
2    15.99
3    25.99
4    30.49
Name: ProductPrice, dtype: float64

In [5]:
import pandas as pd


product_id = [101, 102, 103, 104, 105]
product_name = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
product_price = [10.99, 20.49, 15.99, 25.99, 30.49]

df = pd.DataFrame({
    'ProductID': product_id,
    'ProductName': product_name,
    'ProductPrice': product_price
})


for i in range(len(df)):
    row = df.iloc[i]
    print("Row", i+1, ":")
    print(row)
    print()

Row 1 :
ProductID             101
ProductName     Product A
ProductPrice        10.99
Name: 0, dtype: object

Row 2 :
ProductID             102
ProductName     Product B
ProductPrice        20.49
Name: 1, dtype: object

Row 3 :
ProductID             103
ProductName     Product C
ProductPrice        15.99
Name: 2, dtype: object

Row 4 :
ProductID             104
ProductName     Product D
ProductPrice        25.99
Name: 3, dtype: object

Row 5 :
ProductID             105
ProductName     Product E
ProductPrice        30.49
Name: 4, dtype: object

In [7]:
import pandas as pd


product_id = [101, 102, 103, 104, 105]
product_name = ['Product A', 'Product B', 'Product C', 'Product D', 'Product E']
product_price = [10.99, 20.49, 15.99, 25.99, 30.49]

df = pd.DataFrame({
    'ProductID': product_id,
    'ProductName': product_name,
    'ProductPrice': product_price
})


row_index = 2  
data_from_3rd_row = df.loc[row_index, 'ProductName']
print("Data from the third row (Product Name):", data_from_3rd_row)

Data from the third row (Product Name): Product C

In [1]:
import pandas as pd

data = {
    'product_name': ['Product A', 'Product B', 'Product C', 'Product D'],
    'price': [10, 20, 30, 40]
}

df = pd.DataFrame(data)


price_2nd_row = df.iloc[1]['price']
print(price_2nd_row)

20

In [8]:
import pandas as pd

data = {
    'product_name': ['Product A', 'Product B', 'Product C', 'Product D'],
    'price': [10, 20, 30, 40]
}

df = pd.DataFrame(data)

data_subset = df.iloc[1:4, :].drop(columns=['price'])
print(data_subset)

  product_name
1    Product B
2    Product C
3    Product D

In [3]:
import pandas as pd

data = {
    'product_name': ['Product A', 'Product B', 'Product C', 'Product D'],
    'price': [10, 20, 30, 40]
}

df = pd.DataFrame(data)

price_subset = df.iloc[0:3]['price']
print(price_subset)

0    10
1    20
2    30
Name: price, dtype: int64

In [4]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Marks': [35, 42, 38, 55, 60]
}

df = pd.DataFrame(data)

df.loc[df['Marks'] < 40, 'Marks'] = 41

print(df)

   Student_ID    Name  Marks
0           1    John     41
1           2    Umma     42
2           3    Luke     41
3           4  Sophia     55
4           5  Oliver     60

In [5]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 95, 100, 98],
    'Science': [85, 88, 92, 97, 99],
    'English': [75, 85, 88, 92, 95]
}

df = pd.DataFrame(data)


df[['Maths', 'Science', 'English']] += 2

df[['Maths', 'Science', 'English']] = df[['Maths', 'Science', 'English']].applymap(lambda x: min(x, 100))

print(df)

   Student_ID    Name  Maths  Science  English
0           1    John     82       87       77
1           2    Umma     92       90       87
2           3    Luke     97       94       90
3           4  Sophia    100       99       94
4           5  Oliver    100      100       97

In [6]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

maths_mask = df['Maths'] > 50
science_mask = df['Science'] > 60

result = df[maths_mask & science_mask]

print(result)

   Student_ID    Name  Maths  Science  English
0           1    John     80       85       75
1           2    Umma     90       88       85
2           3    Luke     55       62       58
4           5  Oliver     70       95       65

In [8]:
import pandas as pd

# Example DataFrame
data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)


result = df[df['Name'].str.startswith('S')]

print(result)

   Student_ID    Name  Maths  Science  English
3           4  Sophia     65       57       62

In [9]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

result = df[df['Name'].str.endswith('a')]

print(result)

   Student_ID    Name  Maths  Science  English
1           2    Umma     90       88       85
3           4  Sophia     65       57       62

In [11]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

df['Total'] = df['Maths'] + df['Science'] + df['English']

max_marks_per_subject = 100  
df['Percentage'] = (df['Total'] / (3 * max_marks_per_subject)) * 100

print(df)

   Student_ID    Name  Maths  Science  English  Total  Percentage
0           1    John     80       85       75    240   80.000000
1           2    Umma     90       88       85    263   87.666667
2           3    Luke     55       62       58    175   58.333333
3           4  Sophia     65       57       62    184   61.333333
4           5  Oliver     70       95       65    230   76.666667

In [12]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

df['Total'] = df['Maths'] + df['Science'] + df['English']

passing_marks = 150  

df['Status'] = df['Total'].apply(lambda x: 'PASS' if x >= passing_marks else 'FAIL')

print(df)

   Student_ID    Name  Maths  Science  English  Total Status
0           1    John     80       85       75    240   PASS
1           2    Umma     90       88       85    263   PASS
2           3    Luke     55       62       58    175   PASS
3           4  Sophia     65       57       62    184   PASS
4           5  Oliver     70       95       65    230   PASS

In [15]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

df['Total'] = df['Maths'] + df['Science'] + df['English']

max_marks_per_subject = 100  
df['Percentage'] = (df['Total'] / (3 * max_marks_per_subject)) * 100

def calculate_grade(percentage):
    if percentage >= 90:
        return 'A'
    elif percentage >= 80:
        return 'B'
    elif percentage >= 70:
        return 'C'
    elif percentage >= 60:
        return 'D'
    elif percentage >= 50:
        return 'E'
    else:
        return 'F'

df['Grade'] = df['Percentage'].apply(calculate_grade)

print(df)

   Student_ID    Name  Maths  Science  English  Total  Percentage Grade
0           1    John     80       85       75    240   80.000000     B
1           2    Umma     90       88       85    263   87.666667     B
2           3    Luke     55       62       58    175   58.333333     E
3           4  Sophia     65       57       62    184   61.333333     D
4           5  Oliver     70       95       65    230   76.666667     C

In [23]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

overall_summary = pd.DataFrame({
    'Total': df.select_dtypes(include='number').sum(),
    'Maximum': df.select_dtypes(include='number').max(),
    'Minimum': df.select_dtypes(include='number').min(),
    'Standard Deviation': df.select_dtypes(include='number').std()
})

print(overall_summary)

            Total  Maximum  Minimum  Standard Deviation
Student_ID     15        5        1            1.581139
Maths         360       90       55           13.509256
Science       387       95       57           16.831518
English       345       85       58           10.931606

In [24]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

overall_summary = pd.DataFrame({
    'Total': df.select_dtypes(include='number').sum(),
    'Maximum': df.select_dtypes(include='number').max(),
    'Minimum': df.select_dtypes(include='number').min(),
    'Standard Deviation': df.select_dtypes(include='number').std()
})


excel_filename = "overall_summary.xlsx"
json_filename = "overall_summary.json"
html_filename = "overall_summary.html"

overall_summary.to_excel(excel_filename)
overall_summary.to_json(json_filename)
overall_summary.to_html(html_filename)

print("Dataframe converted and saved as:")
print(f"Excel: {excel_filename}")
print(f"JSON: {json_filename}")
print(f"HTML: {html_filename}")

Dataframe converted and saved as:
Excel: overall_summary.xlsx
JSON: overall_summary.json
HTML: overall_summary.html

In [25]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  5 non-null      int64
 1   Name        5 non-null      object
 2   Maths       5 non-null      int64
 3   Science     5 non-null      int64
 4   English     5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 332.0+ bytes
None

In [26]:
import pandas as pd

data = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data)

data_dict = df.to_dict(orient='list')

print(data_dict)

{'Student_ID': [1, 2, 3, 4, 5], 'Name': ['John', 'Umma', 'Luke', 'Sophia', 'Oliver'], 'Maths': [80, 90, 55, 65, 70], 'Science': [85, 88, 62, 57, 95], 'English': [75, 85, 58, 62, 65]}

In [2]:
import pandas as pd

data_dict = {
    'Student_ID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Emma', 'Luke', 'Sophia', 'Oliver'],
    'Maths': [80, 90, 55, 65, 70],
    'Science': [85, 88, 62, 57, 95],
    'English': [75, 85, 58, 62, 65]
}

df = pd.DataFrame(data_dict)

df['Maths'] += 500

print(df)

   Student_ID    Name  Maths  Science  English
0           1    John    580       85       75
1           2    Emma    590       88       85
2           3    Luke    555       62       58
3           4  Sophia    565       57       62
4           5  Oliver    570       95       65

In [3]:
# TASK 2

In [4]:
import pandas as pd

In [5]:
import numpy as np

In [6]:
df=pd.read_csv("C:/Users/Admin/Desktop/DATA SCIENCE/datasets (1)/Salaries.csv")

C:\Users\Admin\AppData\Local\Temp\ipykernel_5772\3968335351.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv("C:/Users/Admin/Desktop/DATA SCIENCE/datasets (1)/Salaries.csv")

In [6]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [7]:
df=df.replace('Not Provided',np.nan)

In [8]:
df=df.replace('Not provided',np.nan)

In [9]:
df['BasePay']=df['BasePay'].astype('float')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB

In [11]:
df['BasePay'].mean()

66325.4488404877

In [13]:
df['OvertimePay']=df['OvertimePay'].astype('float')

In [14]:
df['OvertimePay'].max()

245131.88

In [48]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [51]:
df[df['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [52]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].max()] #['EmployeeName']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [53]:
df[df['TotalPayBenefits']== df['TotalPayBenefits'].min()] #['EmployeeName']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [56]:
df['JobTitle'].nunique()

2158

In [57]:
df['JobTitle'].value_counts().head(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [58]:
sum(df[df['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [59]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False